test/fixtures/charge/create.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.dev.strike.acinq.co/api/v1/charges
    body:
      encoding: UTF-8
      string: '{"amount":42000,"currency":"btc","description":"1%20Blockaccino","customer_id":"This
        is a random test field"}'
    headers:
      User-Agent:
      - Faraday v0.15.3
      Content-Type:
      - application/json
      Authorization:
      - Basic c2tfb1kzWkJ0N0E2c1F6cmdQMjFDTHdyRmQ4em1wbTQ6
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Content-Type, Authorization, X-XSRF-TOKEN
      - x-requested-with
      Access-Control-Allow-Methods:
      - GET, POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Cache-Control:
      - public, no-store, max-age=0
      Content-Type:
      - application/json
      Date:
      - Wed, 14 Nov 2018 18:56:43 GMT
      Server:
      - nginx/1.12.1
      Content-Length:
      - '627'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "id" : "ch_LzQ9ASJS9KABeqdWhCjCGuK2uiee4",
          "object" : "charge",
          "amount" : 42000,
          "currency" : "btc",
          "amount_satoshi" : 42000,
          "payment_hash" : "45650759390b8b65d5a0f062cea3d773bcf443f91cc39ab2b6acc92aca65849d",
          "payment_request" : "lntb420u1pd7cmltpp5g4jswkfepw9kt4dq7p3vag7hww70gslernpe4v4k4nyj4jn9sjwsdqcxyjnyvzzd3hkx6mpvd3kjmn0cqp2qy5vla4tjrm4l9u9wf9sycxlsqyxepelsjezlx302p58992re83yx73mjnpz7arfnzyxqm8cnuratqlzvgxus26w4rl27zq2g0prjmqqyt3vup",
          "description" : "1%20Blockaccino",
          "customer_id" : "This is a random test field",
          "paid" : false,
          "created" : 1542221803505,
          "updated" : 1542221803505
        }
    http_version: 
  recorded_at: Wed, 14 Nov 2018 18:56:43 GMT
recorded_with: VCR 3.0.3
