test/fixtures/charge/error_invalid_api_key.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.dev.strike.acinq.co/api/v1/charges
    body:
      encoding: UTF-8
      string: '{"amount":42000,"currency":"btc","description":"1%20Blockaccino","customer_id":"This
        is a random test field"}'
    headers:
      User-Agent:
      - Faraday v0.15.3
      Content-Type:
      - application/json
      Authorization:
      - Basic Zm9vOg==
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Access-Control-Allow-Headers:
      - Content-Type, Authorization, X-XSRF-TOKEN
      - x-requested-with
      Access-Control-Allow-Methods:
      - GET, POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Cache-Control:
      - public, no-store, max-age=0
      Content-Type:
      - application/json
      Date:
      - Wed, 14 Nov 2018 03:42:46 GMT
      Server:
      - nginx/1.12.1
      Content-Length:
      - '57'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "code" : 401,
          "message" : "authentication failed"
        }
    http_version: 
  recorded_at: Wed, 14 Nov 2018 03:42:47 GMT
recorded_with: VCR 3.0.3
